# Measures of Variability<p style="border:6px solid #ffd700"></p>

Name: **Robb Ryan P. Calvez** <br>
Course: **CPE2A**

import **pandas, numpy,** and **matplotlib**

In [2]:
import pandas as pd
import numpy as np 
import matplotlib as mpl

Create a **DataFrame** for "Pizza-prices"

In [3]:
df = pd.read_csv("Pizza-prices.csv")
df

    Position  New York City  Los Angeles
0          1              1          1.0
1          2              2          2.0
2          3              3          3.0
3          4              3          4.0
4          5              5          5.0
5          6              6          6.0
6          7              7          7.0
7          8              8          8.0
8          9              9          9.0
9         10             11         10.0
10        11             66          NaN

Display a **concise summary** of the DataFrame

In [4]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 11 entries, 0 to 10
Data columns (total 3 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   Position       11 non-null     int64
 1   New York City  11 non-null     int64
 2   Los Angeles    10 non-null     float64
dtypes: float64(1), int64(2)
memory usage: 396.0 bytes

Display the **summary statistics**

In [5]:
df.describe()

        Position  New York City  Los Angeles
count  11.000000      11.000000     10.00000
mean    6.000000      11.000000      5.50000
std     3.316625      18.504054      3.02765
min     1.000000       1.000000      1.00000
25%     3.500000       3.000000      3.25000
50%     6.000000       6.000000      5.50000
75%     8.500000       8.500000      7.75000
max    11.000000      66.000000     10.00000

## New York City

Return the **range** of NY Pizza Prices

In [7]:
ny_range = df['New York City'].max() - df['New York City']. min()
print("NY Price Range = $" + str(ny_range))

NY Price Range = $ 65

Return the **variance**

In [9]:
ny_var = df['New York City'].var()
print("NY Price Variance = $" + str(ny_var))

NY Price Variance = $342.4

Return the **standard deviation**

In [10]:
ny_sd = df['New York City'].std()
print("NY Price Standard Deviation = $" + str(ny_sd.round(1)))

NY Price Standard Deviation = $18.5

Return the **coefficent of variance**

Vizualize the Measures of Variability using Boxplot

## Los Angeles

Return the **range** of LA Pizza Prices

Return the **variance**

Return the **standard deviation**

Return the **coefficient of variance**

Visualize the Measures of Variability using **Boxplot**

## Hypothesis